import React from 'react';

// material-ui
import {
  Box,
  Stack,
  Typography
} from '@mui/material';


// ==============================|| DASHBOARD - DEFAULT ||============================== //

const Work = () => {

  return (
    <Box>
      <Stack direction="row" alignItems="center" justifyContent="space-between" mb={2}>
        <Typography variant="h4">工作</Typography>
      </Stack>
      目前工作5年，3年前端程式開發、2年的網頁設計與網頁企畫經驗，歷程涵蓋了需求訪談、網頁設計規劃、使用者體驗、前端開發、RWD 響應式跨平台的應用。

      轉職有筆記可以幫助開發更快速，下面是程式相關的筆記
      https://teishashu.github.io/hexo_blogger/

      (找米粒介紹的影片寫~~充滿熱情的自我介紹)
      自己蠻喜歡這領域，因為特質視覺方面被訓練至少7年，又喜歡比較有規律標準化的特性，寫前端程式想做的好要具備2者，很像把鍵盤變成調色盤來畫圖，而且這工作除了邏輯實作功能外，跟使用者比較接近，跨領域的背景和原本的科系讓我對使用者的敏銳度蠻高的。像目前的工作有新舊系統翻新，很直接看到使用者的前後反饋讓我很有成就感。


      補:一些作品圖

      [轉職見證]
      我覺得文科出生的人面臨職場，容易遇到有技能、專業薪資卻不高，工作上無法有數據的讓老闆了解價值，一張好的圖產生多少效應，很多人不是領低薪穩穩地做就是自己開工作室。
      畢業工作一陣子後，覺得這2條都不是我想要的路，過程中以為要轉繪師專門畫圖，但是摸索一年畫超過100張圖平均一周2.5張的程度，禱告中跟神討論後，神說我要去寫程式，寫程式可以幫助我空提!
      所以即使一開始不是很擅長寫程式，邏輯沒有特別強，但是神引導的路不會只有自己走，過程中也透過很多人幫助自己，在訓練往獨立作業卡關時，卻變成信仰最好的時候，每次工作中詢問聖靈這 bug 要怎麼解，問題卡在哪裡呢? 聖靈都會賜下靈感要去看哪個地方，漸漸地轉職就成功了!

      回顧這段時間，
      覺得自己做事情總是喜歡做很多功課在下決定，可是有信仰後應該要更多跟神討論，神比自己更了解自己。跟程式從來沒關係的我，能跨到這領域真是太不可思議了，轉職後原本科系也沒有白費反而可以加乘，變成市場上的稀缺人才。
      換領域最大的困難是思維上的轉換，藝術創意是要打破既有的垂直思考，水平思考中怎麼連結可以有更多的可能性，程式反而是超級強調垂直的邏輯步驟，過程中卡住就以禱告、詢問前輩來慢慢前進，這能力訓練好後真的就像一開始禱告神說可以幫助自己的空提，信仰比較低潮時知道怎麼分析步驟幫助自己前進，而不是只靠感覺。

      期間有很多的成長，其中關於「交託給神」也有不一樣的看見。
      之前常常禱告後還是壓力很大，過程中發現如果神成為自己的方向盤，困難中整體還是順的，只要把一個個問題解決也立下義的條件，即使過程中有時候會覺得怎麼會這樣，但神會在不同時機把自己放在最適合的地方，不會有任何的虧損、吃虧，一路上都是訓練、為長期做準備，很感謝神超有耐心的安排、帶領!
    </Box>
  );
};

export default Work;